cask_args appdir: '/Applications'

#taps
tap "heroku/brew"
tap "fbsb/flutter"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

# Shell stuff
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Development Stuff
brew "vim"
brew "chruby"
brew "ruby-install"
brew 'nodejs'
brew 'npm'
brew 'nvm'
brew 'yarn'
brew 'sqlite'
brew 'jq'
brew 'git'
brew 'git-lfs'
brew 'httpie'
brew 'heroku'
brew 'postgresql'
brew 'redis'
brew 'libxml2'
brew 'imagemagick'
brew 'ctags'
#brew 'vips' This is taking far too long to install

#utilities
brew "wget"
brew "fzf"
brew "ag"
brew "ranger"

# Applications
cask 'google-chrome'
cask 'iterm2'
cask 'chromedriver'
cask 'java'
cask 'discord'
cask 'hammerspoon'
cask 'paw'
cask 'firefox'
cask 'hey'
cask 'sqlpro-studio'
cask 'paw'
cask 'dash'
cask '1password'

# Drivers
cask 'logitech-options'
cask 'logitech-camera-settings'

# Fonts
cask "font-fira-code"
cask 'font-fira-code-nerd-font'
cask 'font-source-sans-pro'
